Repository: zuugle-services/wp-diana-widget
Catalog: languages/diana-greenconnect-*_formal.po
Languages: de

source: Get Your Free API Credentials
de: Holen Sie sich jetzt Ihren API Zugang

source: To use the Diana GreenConnect widget, you need a Client ID and Client Secret. Register on our developer dashboard to create an application and get your credentials instantly.
de: Um das Diana GreenConnect Widget benutzen zu können, brauchen Sie eine Client ID und ein Client Secret. Registrieren Sie sich hierfür bei unserem Entwickler Dashboard, um die Applikation und die Zugangsdaten sofort zu erhalten.

source: Register on zuugle-services.com
de: Registrieren Sie sich auf zuugle-services.com

source: Enter your Diana GreenConnect Widget Client ID.
de: Geben Sie Ihre Diana GreenConnect Widget Client ID ein.

source: Enter your Diana GreenConnect Widget Client Secret. This will be stored securely.
de: Geben Sie Ihr Diana GreenConnect Widget Client Secret ein. Es wird sicher gespeichert.

source: Test Connection
de: Testen Sie die Verbindung

source: Shortcode Documentation
de: Shortcode Dokumentation

source: Use the shortcode to display the widget anywhere on your site, including in the Classic Editor, page builders, or text widgets. All block attributes are supported. Convert attribute names to all lowercase, for example, `activityName` becomes `activityname`.
de: Benutzen Sie den Shortcode, um das Widget auf Ihrer Seite einzubinden, z.B. im Klassischen Editor, verschiedenen Seiten-Builders oder in Text Widgets. Auch Elementor wird unterstützt. Alle Block Attribute sind unterstützt. Konvertieren sie die Attributnamen alle zu Kleinbuchstaben, zum Beispiel: 'activityName' wird zu 'activityname'.

source: Example:
de: Beispiel:

source: Note: Providing a unique `widgetid` is required for the start location caching feature to work correctly with shortcodes.
de: Notice: Es ist notwendig eine eindeutige 'widgetid' anzugeben, damit das Caching der Start Location richtig funktionieren kann.

source: Diana GreenConnect Settings
de: Diana GreenConnect Einstellungen

source: API Credentials
de: API Zugangsdaten
